meethodu/app/views/profile/show.html.erb

          <tr class="<%= cycle('mee_line_odd', 'mee_line_even') %>" >
          <% @user_name=User.find_by_user_id(in_request.sent_user_id) %>
          <% @project=Project.find( in_request.project_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = 'mee1' LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 19 LIMIT 1