meethodu/app/views/my_contributions/get_my_contributions.html.erb

        <tr class="<%= cycle('mee_line_odd', 'mee_line_even') %>" >
            <% @project=Project.find(in_contri.project_id) %>
            <td><%=  link_to @project.name, @project%></td>
            <% @user=User.find_by_user_id(@project.user_id) %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."project_id" = 18 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."user_id" = 'mee1' LIMIT 1