meethodu/app/views/projects/show.html.erb

  <b>Sponsored By:</b>
  <% @project_sponsor = User.find_by_user_id(@project.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = 'mee1' LIMIT 1