meethodu/app/controllers/donor_requests_controller.rb

  def index
    @donor_requests = DonorRequest.all
---
SELECT "donor_requests".* FROM "donor_requests"

  def show
    @donor_request = DonorRequest.find(params[:id])
---
SELECT "donor_requests".* FROM "donor_requests" WHERE "donor_requests"."id" = -616856778 LIMIT 1

  def edit
    @donor_request = DonorRequest.find(params[:id])
---
SELECT "donor_requests".* FROM "donor_requests" WHERE "donor_requests"."id" = 1 LIMIT 1

  def create
    @donor_request = DonorRequest.new
    @donor_request.project_id = params[:project][:id]
    @donor_request.sent_user_id = session[:user_text_id]
    @donor_request.sent_date = Time.now
    @donor_request.sent_money = params[:loan_amount]
    @donor_request.receiver_accepted = false
    @donor_request.seen_by_receiver = false
    @donor_request.seen_by_sender = false
    @donor_request.sponsor_received_money = false
    @donor_request.sent = false

    respond_to do |format|
      if @donor_request.save
---
INSERT INTO "donor_requests" ("seen_by_receiver", "sent_user_id", "created_at", "updated_at", "sponsor_received_money", "sent", "sent_money", "seen_by_sender", "receiver_accepted", "sent_date", "project_id") VALUES ('f', 'mee1', '2011-09-10 04:47:20.106184', '2011-09-10 04:47:20.106184', 'f', 'f', 5, 'f', 'f', '2011-09-10 04:47:20.105300', 21)

  def update
    @donor_request = DonorRequest.find(params[:id])

    respond_to do |format|
      if @donor_request.update_attributes(params[:donor_request])
---
SELECT "donor_requests".* FROM "donor_requests" WHERE "donor_requests"."id" = 2 LIMIT 1
UPDATE "donor_requests" SET "sent" = 't', "sent_money" = 0, "updated_at" = '2011-09-08 13:18:55.770766' WHERE "donor_requests"."id" = 5

  def destroy
    @donor_request = DonorRequest.find(params[:id])
    @donor_request.destroy
---
SELECT "donor_requests".* FROM "donor_requests" WHERE "donor_requests"."id" = 1 LIMIT 1
DELETE FROM "donor_requests" WHERE "donor_requests"."id" = 1

  def accept
        @donor_request = DonorRequest.find(params[:id])
        @donor_request.receiver_accepted = true
        @donor_request.seen_by_receiver = true
        if @donor_request.save
---
SELECT "donor_requests".* FROM "donor_requests" WHERE "donor_requests"."id" = 1 LIMIT 1
UPDATE "donor_requests" SET "seen_by_receiver" = 't', "updated_at" = '2011-09-10 01:09:59.751697', "receiver_accepted" = 't' WHERE "donor_requests"."id" = 8

  def reject
        @donor_request = DonorRequest.find(params[:id])
        @donor_request.receiver_accepted = false
        @donor_request.seen_by_receiver = true
        if @donor_request.save
---
SELECT "donor_requests".* FROM "donor_requests" WHERE "donor_requests"."id" = 3 LIMIT 1
UPDATE "donor_requests" SET "receiver_accepted" = 'f', "seen_by_receiver" = 't', "updated_at" = '2011-09-10 05:00:33.121722' WHERE "donor_requests"."id" = 11