meethodu/app/controllers/friendships_controller.rb

SELECT "friendships".* FROM "friendships"
---
  def index
    @friendships = Friendship.all

SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = 1 LIMIT 1
---
  def show
    @friendship = Friendship.find(params[:id])

SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = 1 LIMIT 1
---
  def edit
    @friendship = Friendship.find(params[:id])

INSERT INTO "friendships" ("friend2_id", "begin_date", "friend1_id", "how_do_you_know", "updated_at", "created_at") VALUES (0, '2011-09-02', 0, 'pullamma met me while cleaning restrooms', '2011-09-02 23:03:52.372663', '2011-09-02 23:03:52.372663')
---
  def create
    @friendship = Friendship.new
    @friendship.friend1_id = params[:id]
    @friendship.friend2_id = session[:user_text_id]
    @friendship.begin_date = Time.now
    destroy_friendship_sent_request()
    respond_to do |format|
      if @friendship.save

SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = 1 LIMIT 1
UPDATE "friendships" SET "friend2_id" = 7, "friend1_id" = 1, "updated_at" = '2011-09-02 23:04:12.924411' WHERE "friendships"."id" = 1
---
  def update
    @friendship = Friendship.find(params[:id])

    respond_to do |format|
      if @friendship.update_attributes(params[:friendship])