meethodu/app/controllers/friendship_sent_requests_controller.rb

  def index
    @friendship_sent_requests = FriendshipSentRequest.all
---
SELECT "friendship_sent_requests".* FROM "friendship_sent_requests"

  def show
    @friendship_sent_request = FriendshipSentRequest.find(params[:id])
---
SELECT "friendship_sent_requests".* FROM "friendship_sent_requests" WHERE "friendship_sent_requests"."id" = 1 LIMIT 1

  def edit
    @friendship_sent_request = FriendshipSentRequest.find(params[:id])
---
SELECT "friendship_sent_requests".* FROM "friendship_sent_requests" WHERE "friendship_sent_requests"."id" = 9 LIMIT 1

  def create
    @friendship_sent_request = FriendshipSentRequest.new(params[:friendship_sent_request])

    respond_to do |format|
      if @friendship_sent_request.save
---
INSERT INTO "friendship_sent_requests" ("created_at", "message", "sent_date", "updated_at", "from_user", "to_user") VALUES ('2011-09-10 04:41:29.686546', 'hi this is a4anishm, second request', '2011-09-10 04:41:29.685963', '2011-09-10 04:41:29.686546', 'a4anishm', 'mee1')

  def update
    @friendship_sent_request = FriendshipSentRequest.find(params[:id])
---
SELECT "friendship_sent_requests".* FROM "friendship_sent_requests" WHERE "friendship_sent_requests"."id" = 10 LIMIT 1

  def destroy
    @friendship_sent_request = FriendshipSentRequest.find(params[:id])
    @friendship_sent_request.destroy
---
DELETE FROM "friendship_sent_requests" WHERE "friendship_sent_requests"."id" = 12