meethodu/app/controllers/my_contributions_controller.rb

SELECT "donor_requests".* FROM "donor_requests" WHERE "donor_requests"."sent_user_id" = 'mee1' LIMIT 1
---
  def get_my_contributions
    @my_contributions = DonorRequest.find_all_by_sent_user_id(session[:user_text_id])