meethodu/app/controllers/profile_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" = 'mee1' LIMIT 1
SELECT "users".* FROM "users" LEFT OUTER JOIN friendship_sent_requests on friendship_sent_requests.from_user = users.user_id WHERE (friendship_sent_requests.to_user = ''pullamma'')
SELECT "donor_requests".* FROM "donor_requests" INNER JOIN projects on donor_requests.project_id = projects.id WHERE "donor_requests"."seen_by_receiver" = 'f' AND (projects.user_id = 'mee1')
SELECT "donor_requests".* FROM "donor_requests" INNER JOIN projects on donor_requests.project_id = projects.id WHERE "donor_requests"."sent" = 't' AND "donor_requests"."sponsor_received_money" = 'f' AND ( projects.user_id = 'mee1')
---
  def show
    if(session[:user_id] == 0)
      redirect_to(login_url)
      return
    end
    @user = User.find_by_user_id(session[:user_text_id])
    @friends = User.joins("INNER JOIN friendships on friendships.friend1_id = users.user_id").where("friendships.friend2_id = ?", session[:user_text_id])
    @incoming_friend_users = User.joins("INNER JOIN friendship_sent_requests on friendship_sent_requests.from_user = users.user_id").where("friendship_sent_requests.to_user = ?", session[:user_text_id])
    @incoming_donation_requests = DonorRequest.joins("INNER JOIN projects on donor_requests.project_id = projects.id ").where("projects.user_id = ?", session[:user_text_id]).find_all_by_seen_by_receiver(false)
    @incoming_sent_money_updates = DonorRequest.joins("INNER JOIN projects on donor_requests.project_id = projects.id ").where(" projects.user_id = ?", session[:user_text_id]).find_all_by_sent_and_sponsor_received_money(true,false)