meethodu/app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
    @amount_raised = ProjectFunding.sum(:funding_money, :conditions => ['project_id = ?', @project.id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT SUM("project_fundings"."funding_money") AS sum_id FROM "project_fundings" WHERE (project_id = 22)

  def create
    @project = Project.new(params[:project])
    @project.user_id = session[:user_text_id]
    respond_to do |format|
      if (@project.user_id!=0 && @project.save )
---
INSERT INTO "projects" ("minimum_budget", "user_id", "maximum_budget", "updated_at", "name", "summary", "description", "need_referral", "days_to_return_money", "project_id", "created_at") VALUES (3000, 'mee1', 5000, '2011-09-10 04:19:03.215208', 'sewing machines', 'This is sewing machine sproject', 'This is needed for my household maid ramanamma who need a sewing machine to support herself self by gettign som esupplemental income for herself.', 'f', 30, NULL, '2011-09-10 04:19:03.215208')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if (@project.user_id!=0 && @project.user_id == session[:user_text_id] && @project.update_attributes(params[:project]) )
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 12 LIMIT 1
UPDATE "projects" SET "updated_at" = '2011-09-08 12:06:06.616770', "minimum_budget" = 86 WHERE "projects"."id" = 16

  def my_projects
    @my_projects = Project.where("user_id = ?",session[:user_text_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 'mee1' LIMIT 1