meethodu/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" = 'anish' LIMIT 1
---
  def create
    if user=User.authenticate(params[:user_text_id], params[:password])
      session[:user_id] = user.id
      session[:user_text_id] = user.user_id
      session[:login_status] = 1
      session[:first_name] = user.first_name