meethodu/app/controllers/test_products_controller.rb

SELECT "test_products".* FROM "test_products"
---
  def index
    @test_products = TestProduct.all