meethodu/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
SELECT "users".* FROM "users"
---
  def index
    @user = User.find(session[:user_id])
    if @user
      redirect_to(:action => show)
    else
      @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
---
  def new
    if(session[:user_id] == 0)
      @user = User.new
    else
      @user = User.find(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def edit
    @user = User.find(session[:user_id])

INSERT INTO "users" ("address_line2", "date_of_birth", "about_me", "created_at", "city", "zipcode", "interests", "phone_number", "address_line1", "first_name", "user_id", "area_code", "gender", "updated_at", "state", "last_name") VALUES ('Bapatla', NULL, 'I prefer to work on small scale projects which are always good for me. I will raise 10 chicken and sell them for meat and egg.', '2011-09-02 21:15:47.707226', 'bapatla', 522101, 'poultry', NULL, 'narasayapalem', 'ellamma', 'ellamma', NULL, 'female', '2011-09-02 21:15:47.707226', 'andhr apradesh', 'konderapu')
SELECT 1 FROM "users" WHERE ("users"."user_id" = 'anish') LIMIT 1
---
  def create
    @user = User.new(params[:user])
    if(params[:captcha] != 'upeckshin')
      redirect_to("/users/new/", :notice => 'Image text you entered is wrong.')
      # render :action => "new", :alert => 'Image text you entered is wrong.'
      return
    end
    respond_to do |format|
      if @user.save
        session[:login_status] = 1
        session[:user_id] = @user.id
        session[:user_text_id] = @user.user_id
        session[:first_name] = @user.first_name

SELECT 1 FROM "users" WHERE ("users"."user_id" = 'ellamma') AND ("users".id <> 2) LIMIT 1
UPDATE "users" SET "interests" = 'chatting,dating', "updated_at" = '2011-09-10 04:46:26.061829' WHERE "users"."id" = 9
---
  def update
    @user = User.find(session[:user_id])

    respond_to do |format|
      if @user.update_attributes(params[:user])